000100 IDENTIFICATION DIVISION.
000200  PROGRAM-ID. processtransactions.
000300  AUTHOR. Marco Cella.
000400  Installation. Process account transactions.
000500  Date-Written. 2025/05/21.
000600  Date-Compiled. 2025/05/21.
000700*
000800 ENVIRONMENT DIVISION.
000900  CONFIGURATION SECTION.
001000   Source-Computer. ALPINE-3-21.
001100   Object-Computer. ALPINE-3-21.
001200  INPUT-OUTPUT SECTION.
001300   FILE-CONTROL.
001400     SELECT TRANSACTIONSFILE 
001500       ASSIGN TO "/opt/app/storage/transactions.idx"
001600       ORGANIZATION IS INDEXED
001700       ACCESS MODE IS DYNAMIC
001800       RECORD KEY IS TRANSACTION-IKEY
001900       ALTERNATE KEY IS SOURCE-ID WITH DUPLICATES
002000       ALTERNATE KEY IS DESTINATION-ID WITH DUPLICATES
002100       FILE STATUS IS TRANSACTIONS-FILE-STATUS.
002200*
002300     SELECT ACCOUNTSFILE ASSIGN TO "/opt/app/storage/accounts.idx"
002400       ORGANIZATION IS INDEXED
002500       ACCESS MODE IS DYNAMIC
002600       RECORD KEY IS ACCOUNT-IKEY
002700       FILE STATUS IS ACCOUNTS-FILE-STATUS.
002800*
002900 DATA DIVISION.
003000  FILE SECTION.
003100   FD TRANSACTIONSFILE
003200     RECORD CONTAINS 100 CHARACTERS.
003300   01 TRANSACTIONSFILEFD.
003400     05 TRANSACTION-IKEY PIC 9(4).
003500     05 SOURCE-ID PIC 9(4).
003600     05 DESTINATION-ID PIC 9(4).
003700     05 AMOUNT PIC S9(29)V99 COMP-3.
003800     05 DATEANDTIME.
003900       10 CURRENTDATE.
004000         15 DATE-YYYY PIC 9999.
004100         15 DATE-MM PIC 99.
004200         15 DATE-DD PIC 99.
004300       10 CURRENTTIME.
004400         15 TIME-HH PIC 99.
004500         15 TIME-MM PIC 99.
004600         15 TIME-SS PIC 99.
004700         15 TIME-MS PIC 999999.
004800*
004900   FD ACCOUNTSFILE
005000     RECORD CONTAINS 100 CHARACTERS.
005100   01 ACCOUNTSFILEFD.
005200     05 ACCOUNT-IKEY PIC 9(4).
005300     05 BALANCE-TOTAL PIC S9(29)V99 COMP-3.
005400     05 LAST-CREDIT-TRANSACTION PIC 9(4).
005500     05 LAST-DEBIT-TRANSACTION PIC 9(4).
005600*
005700  WORKING-STORAGE SECTION.
005800   01 TRANSACTIONS-FILE-STATUS PIC XX.
005900   01 ACCOUNTS-FILE-STATUS PIC XX.
006000   01 WS-ENDOFFILE PIC 9 VALUE ZERO.
006100   01 WS-FILE-ERROR PIC 9 VALUE ZERO.
006200   01 WS-TRANSACTIONSFILEFD.
006300     05 WS-TRANSACTION-IKEY PIC 9(4).
006400     05 WS-SOURCE-ID PIC 9(4).
006500     05 WS-DESTINATION-ID PIC 9(4).
006600     05 WS-AMOUNT PIC S9(29)V99 COMP-3.
006700     05 WS-DATEANDTIME.
006800       10 WS-CURRENTDATE.
006900         15 WS-DATE-YYYY PIC 9999.
007000         15 WS-DATE-MM PIC 99.
007100         15 WS-DATE-DD PIC 99.
007200       10 WS-CURRENTTIME.
007300         15 WS-TIME-HH PIC 99.
007400         15 WS-TIME-MM PIC 99.
007500         15 WS-TIME-SS PIC 99.
007600         15 WS-TIME-MS PIC 999999.
007700   77 DISPLAY-DATE PIC XXXX/XX/XX.
007800   77 DISPLAY-TIME PIC XXXX/XX/XXXXXX.
007900   01 WS-NEXT-KEY PIC 9(4) VALUE ZEROS.
008000*
008100   01 WS-ACCOUNTSFILEFD.
008200     05 WS-ACCOUNT-IKEY PIC 9(4).
008300     05 WS-BALANCE-TOTAL PIC S9(29)V99 COMP-3.
008400     05 WS-LAST-CREDIT-TRANSACTION PIC 9(4).
008500     05 WS-LAST-DEBIT-TRANSACTION PIC 9(4).
008600   77 WS-NEW-BALANCE-TOTAL PIC S9(29)V99 COMP-3.
008700   77 WS-NEW-LAST-CREDIT-TRANSACTION PIC 9(4).
008800   77 WS-NEW-LAST-DEBIT-TRANSACTION PIC 9(4).
008900*
009000 LINKAGE SECTION.
009100   77 ACCOUNTIKEY PIC 9(4).
009200   77 RETURNCODE PIC XX.
009300*
009400 PROCEDURE DIVISION USING
009500  BY REFERENCE ACCOUNTIKEY
009600  BY REFERENCE RETURNCODE.
009700     DISPLAY "PROCESS ACCOUNT TRANSACTIONS."
009800     DISPLAY "Account key: " ACCOUNTIKEY.
009900     IF ACCOUNTIKEY IS NOT NUMERIC
010000       DISPLAY "Wrong key value."
010100       MOVE "01" TO RETURNCODE
010200       GO TO QUIT
010300     END-IF.
010400*
010500     MOVE ACCOUNTIKEY TO ACCOUNT-IKEY.
010600*
010700     OPEN INPUT ACCOUNTSFILE.
010800       IF ACCOUNTS-FILE-STATUS = "00"
010900         DISPLAY "The file exists."
011000       ELSE IF ACCOUNTS-FILE-STATUS = "35"
011100         DISPLAY "The file does not exist."
011200         MOVE ACCOUNTS-FILE-STATUS TO RETURNCODE
011300         CLOSE ACCOUNTSFILE
011400         GO TO QUIT
011500       ELSE
011600         DISPLAY "An error occurred. Status: " 
011700           ACCOUNTS-FILE-STATUS
011800         MOVE ACCOUNTS-FILE-STATUS TO RETURNCODE
011900         CLOSE ACCOUNTSFILE
012000         GO TO QUIT
012100       END-IF.
012200*
012300       READ ACCOUNTSFILE INTO WS-ACCOUNTSFILEFD
012400         KEY IS ACCOUNT-IKEY
012500           INVALID KEY
012600             DISPLAY "Account not found."
012700             MOVE "03" TO RETURNCODE
012800             CLOSE ACCOUNTSFILE
012900             GO TO QUIT
013000           NOT INVALID KEY
013100             DISPLAY "The account exists."
013200             DISPLAY "Initial account balance: " WS-BALANCE-TOTAL
013300             DISPLAY "Initial Last credit transaction: " 
013400               WS-LAST-CREDIT-TRANSACTION
013500             DISPLAY "Initial Last debit transaction: " 
013600               WS-LAST-DEBIT-TRANSACTION
013700       END-READ.
013800     CLOSE ACCOUNTSFILE.
013900*
014000     MOVE WS-BALANCE-TOTAL TO WS-NEW-BALANCE-TOTAL.
014100*
014200     MOVE 0 TO WS-ENDOFFILE.
014300     OPEN INPUT TRANSACTIONSFILE.
014400       IF TRANSACTIONS-FILE-STATUS = "00"
014500         DISPLAY "The file exists."
014600       ELSE IF TRANSACTIONS-FILE-STATUS = "35"
014700         DISPLAY "The file does not exist."
014800         MOVE TRANSACTIONS-FILE-STATUS TO RETURNCODE
014900         CLOSE TRANSACTIONSFILE
015000         GO TO QUIT
015100       ELSE
015200         DISPLAY "An error occurred. Status: " 
015300           TRANSACTIONS-FILE-STATUS
015400         MOVE TRANSACTIONS-FILE-STATUS TO RETURNCODE
015500         CLOSE TRANSACTIONSFILE
015600         GO TO QUIT
015700       END-IF.
015800*
015900       MOVE WS-LAST-CREDIT-TRANSACTION TO TRANSACTION-IKEY.
016000       MOVE ACCOUNTIKEY TO DESTINATION-ID.
016100       MOVE WS-LAST-CREDIT-TRANSACTION 
016200         TO WS-NEW-LAST-CREDIT-TRANSACTION.
016300*
016400       START TRANSACTIONSFILE KEY IS EQUAL TO DESTINATION-ID
016500         INVALID KEY
016600           DISPLAY "Transaction not found."
016700           MOVE "03" TO RETURNCODE
016800           CLOSE TRANSACTIONSFILE
016900         NOT INVALID KEY
017000           PERFORM UNTIL WS-ENDOFFILE = 1
017100            READ TRANSACTIONSFILE NEXT RECORD 
017200              INTO WS-TRANSACTIONSFILEFD
017300              AT END MOVE 1 TO WS-ENDOFFILE
017400              NOT AT END
017500                IF NOT WS-DESTINATION-ID = ACCOUNTIKEY
017600                  MOVE 1 TO WS-ENDOFFILE
017700                ELSE
017800                  IF WS-TRANSACTION-IKEY > 
017900                    WS-LAST-CREDIT-TRANSACTION
018000                    DISPLAY "Add credit: " WS-AMOUNT
018100                    ADD WS-AMOUNT TO WS-NEW-BALANCE-TOTAL
018200                    DISPLAY "Partial balance: " 
018300                      WS-NEW-BALANCE-TOTAL
018400                    MOVE WS-TRANSACTION-IKEY 
018500                      TO WS-NEW-LAST-CREDIT-TRANSACTION
018600                  END-IF
018700                END-IF
018800            END-READ
018900           END-PERFORM
019000       END-START.
019100     CLOSE TRANSACTIONSFILE.
019200*
019300     MOVE 0 TO WS-ENDOFFILE.
019400     OPEN INPUT TRANSACTIONSFILE.
019500       IF TRANSACTIONS-FILE-STATUS = "00"
019600         DISPLAY "The file exists."
019700       ELSE IF TRANSACTIONS-FILE-STATUS = "35"
019800         DISPLAY "The file does not exist."
019900         MOVE TRANSACTIONS-FILE-STATUS TO RETURNCODE
020000         CLOSE TRANSACTIONSFILE
020100         GO TO QUIT
020200       ELSE
020300         DISPLAY "An error occurred. Status: " 
020400           TRANSACTIONS-FILE-STATUS
020500         MOVE TRANSACTIONS-FILE-STATUS TO RETURNCODE
020600         CLOSE TRANSACTIONSFILE
020700         GO TO QUIT
020800       END-IF.
020900*
021000       MOVE WS-LAST-DEBIT-TRANSACTION TO TRANSACTION-IKEY.
021100       MOVE ACCOUNTIKEY TO SOURCE-ID.
021200       MOVE WS-LAST-DEBIT-TRANSACTION 
021300         TO WS-NEW-LAST-DEBIT-TRANSACTION.
021400*
021500       START TRANSACTIONSFILE KEY IS EQUAL TO SOURCE-ID
021600         INVALID KEY
021700           DISPLAY "Transaction not found."
021800           MOVE "03" TO RETURNCODE
021900           CLOSE TRANSACTIONSFILE
022000         NOT INVALID KEY
022100           PERFORM UNTIL WS-ENDOFFILE = 1
022200            READ TRANSACTIONSFILE NEXT RECORD 
022300              INTO WS-TRANSACTIONSFILEFD
022400              AT END MOVE 1 TO WS-ENDOFFILE
022500              NOT AT END
022600                IF NOT WS-SOURCE-ID = ACCOUNTIKEY
022700                  MOVE 1 TO WS-ENDOFFILE
022800                ELSE
022900                  IF WS-TRANSACTION-IKEY > 
023000                    WS-LAST-DEBIT-TRANSACTION
023100                    DISPLAY "Subtract debit: " WS-AMOUNT
023200                    SUBTRACT WS-AMOUNT FROM WS-NEW-BALANCE-TOTAL
023300                    DISPLAY "Partial balance: " 
023400                      WS-NEW-BALANCE-TOTAL
023500                    MOVE WS-TRANSACTION-IKEY 
023600                      TO WS-NEW-LAST-DEBIT-TRANSACTION
023700                  END-IF
023800                END-IF
023900            END-READ
024000           END-PERFORM
024100       END-START.
024200     CLOSE TRANSACTIONSFILE.
024300*
024400     MOVE ACCOUNTIKEY TO WS-ACCOUNT-IKEY.
024500     MOVE WS-NEW-BALANCE-TOTAL TO WS-BALANCE-TOTAL.
024600     MOVE WS-NEW-LAST-CREDIT-TRANSACTION 
024700       TO WS-LAST-CREDIT-TRANSACTION.
024800     MOVE WS-NEW-LAST-DEBIT-TRANSACTION 
024900       TO WS-LAST-DEBIT-TRANSACTION.
025000*
025100     OPEN I-O ACCOUNTSFILE.
025200       IF ACCOUNTS-FILE-STATUS = "00"
025300         DISPLAY "The file exists."
025400       ELSE IF ACCOUNTS-FILE-STATUS = "35"
025500         DISPLAY "The file does not exist."
025600         MOVE ACCOUNTS-FILE-STATUS TO RETURNCODE
025700         CLOSE ACCOUNTSFILE
025800         GO TO QUIT
025900       ELSE
026000         DISPLAY "An error occurred. Status: " 
026100           ACCOUNTS-FILE-STATUS
026200         MOVE ACCOUNTS-FILE-STATUS TO RETURNCODE
026300         CLOSE ACCOUNTSFILE
026400         GO TO QUIT
026500       END-IF.
026600
026700       MOVE WS-ACCOUNT-IKEY TO ACCOUNT-IKEY
026800       MOVE WS-BALANCE-TOTAL TO BALANCE-TOTAL
026900       MOVE WS-LAST-CREDIT-TRANSACTION TO LAST-CREDIT-TRANSACTION
027000       MOVE WS-LAST-DEBIT-TRANSACTION TO LAST-DEBIT-TRANSACTION
027100       DISPLAY "Account key: " ACCOUNT-IKEY
027200       DISPLAY "New Account balance total: " BALANCE-TOTAL
027300       DISPLAY "New Last credit transaction: " 
027400         LAST-CREDIT-TRANSACTION
027500       DISPLAY "New Last debit transaction: " 
027600         LAST-DEBIT-TRANSACTION
027700       REWRITE ACCOUNTSFILEFD
027800         INVALID KEY MOVE 1 TO WS-FILE-ERROR
027900         NOT INVALID KEY DISPLAY "Item Updated."
028000       END-REWRITE.
028100     CLOSE ACCOUNTSFILE.
028200*
028300     MOVE "00" TO RETURNCODE.
028400  QUIT.
028500 EXIT PROGRAM.
